{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "unroll": false, "dtype": "float32", "return_sequences": false, "kernel_regularizer": null, "implementation": 1, "activity_regularizer": null, "recurrent_regularizer": null, "stateful": false, "name": "lstm_2", "use_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "units": 8, "go_backwards": false, "return_state": false, "dropout": 0.2, "kernel_constraint": null, "batch_input_shape": [null, 1, 1], "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "units": 1, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null}}], "keras_version": "2.1.1"}