{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_state": false, "use_bias": true, "implementation": 1, "go_backwards": false, "activation": "tanh", "return_sequences": false, "unroll": false, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "dtype": "float32", "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "stateful": false, "units": 8, "bias_constraint": null, "dropout": 0.2, "batch_input_shape": [null, 1, 1], "bias_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "units": 1, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.1"}