{"config": [{"config": {"bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_constraint": null, "kernel_regularizer": null, "return_state": false, "recurrent_regularizer": null, "dtype": "float32", "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "unroll": false, "name": "lstm_5", "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.2, "batch_input_shape": [null, 1, 1], "activity_regularizer": null, "unit_forget_bias": true, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "recurrent_constraint": null, "stateful": false, "units": 8, "return_sequences": false}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "trainable": true, "units": 1, "name": "dense_5"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1"}