{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "LSTM", "config": {"stateful": false, "activation": "tanh", "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 1], "recurrent_activation": "hard_sigmoid", "implementation": 1, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "dropout": 0.2, "recurrent_regularizer": null, "trainable": true, "unit_forget_bias": true, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "name": "lstm_4", "return_state": false, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "return_sequences": false, "kernel_regularizer": null, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_4", "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null}}]}